
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 3 to change, 4 to destroy.</code></pre>

* Create
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password
  * module.sdp_db_user[0].null_resource.setup_sdp_user[&#34;bspayment&#34;]
  * module.sdp_db_user[0].random_password.sdp_read_user_password
* Update
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_key_vault_secret.POSTGRES_HOST
* Delete
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password
  * module.sdp_db_user.null_resource.setup_sdp_user[&#34;bspayment&#34;]
  * module.sdp_db_user.random_password.sdp_read_user_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      + content_type            = ""
        id                      = "https://ccpay-aat.vault.azure.net/secrets/bulkscanning-api-POSTGRES-PASS/92904754acc74469a687cb95367faa9a"
        name                    = "bulkscanning-api-POSTGRES-PASS"
        tags                    = {}
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-USER" {
        id                      = "https://ccpay-aat.vault.azure.net/secrets/bulkscanning-api-POSTGRES-USER/4f119a4933b64fd6b7178c0f7eefe736"
        name                    = "bulkscanning-api-POSTGRES-USER"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
        id                      = "https://ccpay-aat.vault.azure.net/secrets/bulkscanning-api-POSTGRES-HOST/c22f4bb881914cb8be2dc7c118965f53"
        name                    = "bulkscanning-api-POSTGRES-HOST"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name will be destroyed
  # (because module.sdp_db_user is not in configuration)
  - resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      - id                      = "https://mi-vault-dev.vault.azure.net/secrets/ccpay-bulkscanning-api-postgres-db-v15-aat-read-user-name/e8b5790b81f349dfa0c12c0c43e9d282" -> null
      - key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev" -> null
      - name                    = "ccpay-bulkscanning-api-postgres-db-v15-aat-read-user-name" -> null
      - resource_id             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/ccpay-bulkscanning-api-postgres-db-v15-aat-read-user-name/versions/e8b5790b81f349dfa0c12c0c43e9d282" -> null
      - resource_versionless_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/ccpay-bulkscanning-api-postgres-db-v15-aat-read-user-name" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "e8b5790b81f349dfa0c12c0c43e9d282" -> null
      - versionless_id          = "https://mi-vault-dev.vault.azure.net/secrets/ccpay-bulkscanning-api-postgres-db-v15-aat-read-user-name" -> null
    }

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password will be destroyed
  # (because module.sdp_db_user is not in configuration)
  - resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      - content_type            = "" -> null
      - id                      = "https://mi-vault-dev.vault.azure.net/secrets/ccpay-bulkscanning-api-postgres-db-v15-aat-read-user-password/62dfa54cdcad4365a97f060f1eb4f339" -> null
      - key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev" -> null
      - name                    = "ccpay-bulkscanning-api-postgres-db-v15-aat-read-user-password" -> null
      - resource_id             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/ccpay-bulkscanning-api-postgres-db-v15-aat-read-user-password/versions/62dfa54cdcad4365a97f060f1eb4f339" -> null
      - resource_versionless_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/ccpay-bulkscanning-api-postgres-db-v15-aat-read-user-password" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "62dfa54cdcad4365a97f060f1eb4f339" -> null
      - versionless_id          = "https://mi-vault-dev.vault.azure.net/secrets/ccpay-bulkscanning-api-postgres-db-v15-aat-read-user-password" -> null
    }

  # module.sdp_db_user.null_resource.setup_sdp_user["bspayment"] will be destroyed
  # (because module.sdp_db_user is not in configuration)
  - resource "null_resource" "setup_sdp_user" {
      - id       = "7303822406675790918" -> null
      - triggers = {
          - "database"        = "bspayment"
          - "fqdn"            = "ccpay-bulkscanning-api-postgres-db-v15-aat.postgres.database.azure.com"
          - "name"            = "ccpay-bulkscanning-api-postgres-db-v15-aat"
          - "schemas"         = "public"
          - "script_hash"     = "09d8a0c139d2bd77f035b6069cda0083489604daea7bde6a65900fee85b1da84"
          - "sdp_reader_pass" = (sensitive value)
          - "sdp_reader_user" = "SDP_READ_USER"
        } -> null
    }

  # module.sdp_db_user.random_password.sdp_read_user_password will be destroyed
  # (because module.sdp_db_user is not in configuration)
  - resource "random_password" "sdp_read_user_password" {
      - bcrypt_hash      = (sensitive value)
      - id               = "none" -> null
      - length           = 20 -> null
      - lower            = true -> null
      - min_lower        = 0 -> null
      - min_numeric      = 0 -> null
      - min_special      = 0 -> null
      - min_upper        = 0 -> null
      - number           = true -> null
      - numeric          = true -> null
      - override_special = "()-_" -> null
      - result           = (sensitive value)
      - special          = true -> null
      - upper            = true -> null
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name will be created
  + resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev"
      + name                    = "ccpay-bulkscanning-api-postgres-db-v15-aat-read-user-name"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password will be created
  + resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev"
      + name                    = "ccpay-bulkscanning-api-postgres-db-v15-aat-read-user-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.sdp_db_user[0].null_resource.setup_sdp_user["bspayment"] will be created
  + resource "null_resource" "setup_sdp_user" {
      + id       = (known after apply)
      + triggers = {
          + "database"        = "bspayment"
          + "fqdn"            = "ccpay-bulkscanning-api-postgres-db-v15-aat.postgres.database.azure.com"
          + "name"            = "ccpay-bulkscanning-api-postgres-db-v15-aat"
          + "schemas"         = "public"
          + "script_hash"     = "09d8a0c139d2bd77f035b6069cda0083489604daea7bde6a65900fee85b1da84"
          + "sdp_reader_pass" = (sensitive value)
          + "sdp_reader_user" = "SDP_READ_USER"
        }
    }

  # module.sdp_db_user[0].random_password.sdp_read_user_password will be created
  + resource "random_password" "sdp_read_user_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 4 to add, 3 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":522,"Program":"tfcmt","SHA1":"","Vars":{}} -->